app/controllers/posts_controller.rb

  def create
    Post.create(title: params[:post][:post_title], description: params[:post][:post_description])
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2018-06-10 20:31:24.721177"], ["updated_at", "2018-06-10 20:31:24.721177"]]